{"experience":[{"title":"Security Software Engineer","company":"DeepCode","start":"02/2025","end":"Present","location":"Ottawa, ON","alt":"DeepCode","tech":["Microsoft Azure","Python","Flask","MySQL"],"sar":["Designed and refactored a Python monorepo using uv to organize 7 related sub-projects, minimizing overhead between repositories.","Implemented a Telegram message interceptor using Azure event brokers, allowing real time data ingestion for credential breaches."]},{"title":"Co-op Cybersecurity Analyst","company":"BDO Canada","start":"05/2024","end":"07/2024","location":"Ottawa, ON","src":"/images/bdo.png","alt":"BDO Canada","tech":["Microsoft Azure","Powershell","Microsoft Sentinel","KQL","Power BI"],"sar":["Designed Azure KQL analytics rules and heuristics to detect and analyze over 80 unauthorized login attempts against a Wordpress website.","Documented GenAI-assisted threat hunting procedures using Microsoft Copilot, decreasing SOC resolution time by 31% across 189 tickets.","Wrote a Powershell script to find 50 users with unauthorized software installed, consolidating IP and user data from Microsoft Defender."]},{"title":"Co-op Security Specialist","company":"Innovapost","start":"05/2023","end":"08/2023","location":"Ottawa, ON","src":"/images/innovapost.png","alt":"Innovapost","tech":["HTML","JavaScript","VBA"],"sar":["Independently streamlined access control audit timeframes from 2 weeks to 10 minutes by implementing an automation suite with JavaScript and VBA that cross-referenced Excel sheets for discrepancies without the need for external dependencies.","Confirmed antivirus installation was unnecessary on a proprietary OS due to the inherent endpoint protection properties and narrow attack surface by researching CVEs, security features, and antivirus platform support."]},{"title":"Co-op Software Engineer","company":"Barracuda Networks","start":"01/2023","end":"04/2023","location":"Ottawa, ON","src":"/images/barracuda.png","alt":"Barracuda","tech":["C#","ASP.NET","Microsoft Azure","Docker","Linux","Windows","AWS"],"sar":["Designed and implemented a CSV log export system using C#, Blazor, and ASP.NET, saving the IT team up to 30 minutes per incident.","Identified and mitigated a source code leak in a .NET and Blazor application, preventing potential sensitive information disclosure.","Presented selected *AWS* AI services to 5 members of regional leadership, leading to the integration of a new security camera model.","Diagnosed the cause of a failing health check using *Azure Linux* virtual machines and *Docker* tooling, resolving 168 false positive alerts."]},{"title":"Co-op Penetration Tester","company":"SoftwareSecured","start":"05/2022","end":"08/2022","location":"Ottawa, ON","src":"/images/softwaresecured.png","alt":"SoftwareSecured","tech":["Python","Linux","OWASP ZAP","Burp Suite","AWS","FastAPI","Docker","Bash","Ruby on Rails"],"sar":["Identified a hard-coded e-commerce API key in 7 *Ruby on Rails* APIs using Semgrep and Postman, preventing over $1K in API charges.","Implemented a Python script to check open source vulnerability databases for security issues, saving 8 hours of work over 4 engagements.","Automated variant network requests using PyTest and async programming to test over 1M payloads against a REST API endpoint.","Deployed an AWS compute instance, confirming a server-side request forgery vulnerability which led to privilege escalation via AWS Lambda."]},{"title":"Co-op Software Developer","company":"Reshift Security","start":"05/2021","end":"12/2021","location":"Ottawa, ON","src":"/images/reshiftsecurity.png","alt":"Reshift Security","tech":["Python","Django","Angular","PostgreSQL","JavaScript","TypeScript","HTML/CSS","Tailwind","Linux","Docker","Git"],"sar":["Implemented an authentication system with SSO, Oauth2, and JWT technologies in a TypeScript application, mitigating credential breaches.","Overhauled backup workflow for the company database using Django and the SendSafely REST API, allowing incident response within 1 hour.","Created a CI/CD pipeline using Github Actions and Docker to ensure updates were integrated into an internal dashboard within 10 minutes.","Designed a custom metrics dashboard using Angular and d3.js for data visualization surrounding bugs found, including a project heatmap.","Migrated *JavaScript* visualization code for processing data to a custom PostgreSQL query in *Django*, boosting render times by 0.76 seconds.","Built a CVSS calculator integration for a reporting tool using Django and Angular, saving up to 3 hours per penetration test across 15 clients."]}],"projects":[{"title":"FastAPI Automated Security Testing","start":"Jul. 2024","end":"Present","featured":false,"alt":"FastAPI Automated Security Testing","link":"https://github.com/ApprenticeofEnder/FastAPI-automated-security-testing","description":"An educational resource for developers to learn how to use automated test suites for security testing.","tech":["FastAPI","Python"],"sar":["Leveraged realistic examples by implementing example endpoints in FastAPI, both with and without their respective vulnerabilities, along with integration tests for each."]},{"title":"Fief","start":"Aug. 2024","end":"Aug. 2024","featured":false,"alt":"CourseFull","link":"https://github.com/fief-dev/fief/pull/408","description":"A quick contribution to Fief's codebase by fixing a redirect issue that a customer had.","tech":["FastAPI","Python","PostgreSQL"],"sar":null},{"title":"CourseFull","start":"Apr. 2024","end":"Present (WIP)","featured":true,"alt":"CourseFull","link":"https://github.com/ApprenticeofEnder/CourseFull","description":"A Ruby on Rails and NextJS web application that enables students to establish dynamic, data-driven academic goals. Described as a tool pre-med students would \"...[foam] at the mouth over...\" Previously prototyped using PHP at CuHacking 2021, winning first in the Education category.","tech":["Ruby on Rails","React","NextJS","PostgreSQL","Supabase","TailwindCSS","Vitest","Playwright","RSpec"],"sar":["Avoided 3 hours of manual regression testing for each change to a Ruby on Rails REST API by leveraging 190+ automated integration and unit tests with RSpec.","Mitigated the risk of secret leaks, among the number 2 most common vulnerability category in the OWASP Top 10 2021, by using the 1Password Secrets manager, Docker, and environment variables.","Reduced loading times by 50% on session-based components in a NextJS front end by implementing a Supabase session context."]},{"title":"Personal Website","start":"May. 2024","end":"Present","featured":true,"alt":"Personal Website","link":"https://robertbabaev.tech","description":"The latest rendition since May of 2021, this website has switched from a NodeJS/Express web server on Heroku, to using SvelteKit and Django to create a pseudo-CMS on a self-managed DigitalOcean Droplet, to finally using a static SvelteKit website hosted on DigitalOcean's App Platform.","tech":["SvelteKit","DigitalOcean","Tailwind","Flowbite","Git"],"sar":null},{"title":"UpShare (Honours Thesis)","start":"Jan. 2024","end":"Apr. 2024","featured":true,"alt":"UpShare (Honours Thesis)","link":"https://service.scs.carleton.ca/content/honours-project-2024-winter-april-22-2024-933pm","description":"UpShare was my Honours Thesis proposal for the problem of password sharing. I researched various systems of access sharing and control, eventually devising a way of sharing an account without ever having to share a password, usable with consumer-level accounts not initially designed for item sharing.","tech":["React","Redux","MongoDB","Docker","Express","NodeJS"],"sar":["Contributed to usable security research by implementing a passwordless access control and sharing scheme in a retrofitted MERN clone of Instagram."]},{"title":"Ripasso","start":"Jan. 2024","end":"Feb. 2024","featured":false,"alt":"Ripasso","link":"https://github.com/cortex/ripasso/pull/334","description":"Ripasso is a Rust-based, simplified, and fully local password manager. A short-lived participation in a major open-source Rust project, though a fascinating look into developing real software with the language.","tech":["Rust","GTK"],"sar":["Mitigated the risk of potentially sensitive data remaining in the memory of a Rust password manager by resetting values to zero when processing was complete using the “zeroize” crate."]},{"title":"KaliDocker","start":"Oct. 2023","end":"Dec. 2023","featured":false,"alt":"KaliDocker","link":"https://github.com/ApprenticeofEnder/KaliDocker","description":"KaliDocker is a system to quickly deploy Kali Linux Docker containers from any UNIX operating system, enabling flexibility of host OS and freedom from installing and using virtual machines.","tech":["Linux","Docker"],"sar":["Enabled efficient file sharing between host and container using volumes and bind mounts, preventing issues of inefficient file transfer via network."]},{"title":"Selenium Oxide","start":"Mar. 2022","end":"Present","featured":true,"alt":"Selenium Oxide","link":"https://github.com/ApprenticeofEnder/Selenium-Oxide/tree/dev","description":"Created a Selenium wrapper and framework designed to streamline browser-based web exploitation. Endorsed by ex-IBM penetration testers.","tech":["Python","Pytest","FastAPI","Selenium","Docker"],"sar":["Created a containerized testing environment that allowed end-to-end testing with 100% uptime using knowledge of Docker Compose, FastAPI, and Pytest."]}]}