{"experience":[{"title":"Co-op Cybersecurity Analyst","company":"BDO Canada","start":"May. 2024","end":"Jul. 2024","location":"Ottawa, ON","src":"/images/bdo.png","alt":"BDO Canada","tech":["Microsoft Azure","Powershell","Microsoft Sentinel","KQL","Power BI"],"sar":["Introduced a KQL (similar to SQL) analytics rule to detect 80+ brute force login attacks from Microsoft Sentinel with limited available data, speeding up the process of learning with Perplexity AI.","Negotiated access to a vendor's REST API, allowing a cross-platform threat intelligence dashboard solution.","Identified 50+ users with unauthorized software installed using Powershell to resolve disparate data from Microsoft Defender."]},{"title":"Co-op Security Specialist","company":"Innovapost","start":"May. 2023","end":"Aug. 2023","location":"Ottawa, ON","src":"/images/innovapost.png","alt":"Innovapost","tech":["HTML","JavaScript","VBA"],"sar":["Independently devised automation suite for access control audits using HTML, JavaScript, and VBA -- decreased audit timeframes from weeks to minutes.","Evaluated security model of proprietary OS to determine feasibility and necessity of installing antivirus software by investigating CVEs against the OS."]},{"title":"Co-op Software Engineer","company":"Barracuda Networks","start":"Jan. 2023","end":"Apr. 2023","location":"Ottawa, ON","src":"/images/barracuda.png","alt":"Barracuda","tech":["C#","ASP.NET","Microsoft Azure","Docker","Linux","Windows","AWS"],"sar":["Diagnosed RMM incompatibility issues in monitoring clients using Azure VMs, Docker, and Linux, clearing up 1 week of false positive alerts.","Examined and presented to regional leadership select AWS AI and Machine Learning technologies for integration with new product. Received unanimous positive feedback.","Collaborated with colleagues to solve a C# API versioning discrepancy. Negotiated with QA and architecture teams to devise appropriate, considerate solution."]},{"title":"Co-op Penetration Tester","company":"SoftwareSecured","start":"May. 2022","end":"Aug. 2022","location":"Ottawa, ON","src":"/images/softwaresecured.png","alt":"SoftwareSecured","tech":["Python","Linux","OWASP ZAP","Burp Suite","AWS","FastAPI","Docker","Bash","Ruby on Rails"],"sar":["Detected hard-coded credentials in Ruby on Rails application. Reported potential secrets management issue and leakage risk to development team.","Identified critical denial-of-service condition in web application using regular expressions and Burp Suite. Averted 1+ hour long environment shutdown if exploited in the wild.","Optimized network reconnaissance 5-10x using Bash script to find subdomains of primary domain and launch network scans on each.","Implemented Python script to check for open-source vulnerabilities in TypeScript/JavaScript, Ruby, and Python projects using web scraping and concurrent programming techniques, saving 2 hours of work per project.","Tested for server-side request forgery vulnerabilities by deploying AWS virtual machine to catch requests. Hosted custom FastAPI (Python) server for in-depth testing.","Educated clients on security findings using CVSS scoring and realistic attack scenarios to accurately portray business and technical risk."]},{"title":"Co-op Software Developer","company":"Reshift Security","start":"May. 2021","end":"Dec. 2021","location":"Ottawa, ON","src":"/images/reshiftsecurity.png","alt":"Reshift Security","tech":["Python","Django","Angular","PostgreSQL","JavaScript","TypeScript","HTML/CSS","Tailwind","Linux","Docker","Git"],"sar":["Collaboratively engineered secure password reset feature in Angular and Django. Used JWTs and one time passwords to ensure non-repudiation and authenticity.","Overhauled backup workflow for user-facing penetration test management app using Django and SendSafely API. Solved inability to recover from data loss within 1 hour of incident.","Repaired Java-based Intellij plugin suffering from broken breakpoint icons when scanning code. Utilized integrated debuggers and creative troubleshooting.","Installed secure authentication for client-facing application with SSO and JWT authentication in TypeScript and SvelteKit. Mitigated risk of credential compromise via database breach.","Independently maintained Docker-based deployments with virtual machines and Git, ensuring penetration test management app was up to date and new features integrated.","Devised Python script to curate GitHub repositories for CENGN event using appropriate REST API. Enabled list-based elimination vs original lengthy active search.","Programmed custom PostgreSQL queries when Django's ORM failed. Optimized heatmap and other data visualization of security findings using server-side processing vs client-side."]}],"projects":[{"title":"Personal Website","start":"May. 2024","end":"Present","featured":true,"alt":"Personal Website","link":"https://robertbabaev.tech","description":"The latest rendition since May of 2021, this website has switched from a NodeJS/Express web server on Heroku, to using SvelteKit and Django to create a pseudo-CMS on a self-managed DigitalOcean Droplet, to finally using a static SvelteKit website hosted on DigitalOcean's App Platform.","tech":["SvelteKit","DigitalOcean","Tailwind","Flowbite","Git"],"sar":null},{"title":"CourseFull","start":"Apr. 2024","end":"Present","featured":false,"alt":"CourseFull","link":"https://github.com/ApprenticeofEnder/CourseFull","description":"How students know where they're at with grades from the first minute, not the last.","tech":["Ruby on Rails","React","NextJS","PostgreSQL","Supabase","TailwindCSS","Vitest","Playwright","RSpec"],"sar":["Engineered full stack web application using React, NextJS, and Ruby on Rails that allows students to know where they are with grades at all times.","Leveraged 200+ automated unit and end-to-end tests with Rspec, Vitest, and Playwright to ensure code robustness and security, avoiding hours of manual testing and debugging.","Installed Supabase authentication to ensure security guarantees and reduced effort in implementing password storage, etc."]},{"title":"UpShare (Honours Thesis)","start":"Jan. 2024","end":"Apr. 2024","featured":true,"alt":"UpShare (Honours Thesis)","link":"https://service.scs.carleton.ca/content/honours-project-2024-winter-april-22-2024-933pm","description":"UpShare is a passwordless access sharing scheme, similar to RBAC. Roles determine what sort of permissions a user might have, and guests of an account have reduced capabilities, but a quicker, passwordless login.","tech":["React","Redux","MongoDB","Docker","Express","NodeJS"],"sar":["Implemented a framework for secure passwordless access sharing using a retrofitted open source MERN (MongoDB, Express, React, Node) application. Made significant contributions to usable security."]},{"title":"Ripasso","start":"Jan. 2024","end":"Feb. 2024","featured":false,"alt":"Ripasso","link":"https://github.com/cortex/ripasso","description":"Ripasso is a Rust-based, simplified, and fully local password manager. A short-lived participation in a major open-source Rust project, though a fascinating look into developing real software with the language.","tech":["Rust","GTK"],"sar":["Solved memory erase issue in open source Rust password manager using dedicated libraries and unit testing. Improved confidence in secrets being unrecoverable from memory."]},{"title":"KaliDocker","start":"Oct. 2023","end":"Dec. 2023","featured":false,"alt":"KaliDocker","link":"https://github.com/ApprenticeofEnder/KaliDocker","description":"KaliDocker is a system to quickly deploy Kali Linux Docker containers from any UNIX operating system, enabling flexibility of host OS and freedom from installing and using virtual machines.","tech":["Linux","Docker"],"sar":["Enabled efficient file sharing between host and container using volumes and bind mounts, preventing issues of inefficient file transfer via network."]},{"title":"Project NOAH","start":"2023","end":"Present (WIP)","featured":true,"alt":"Project NOAH","link":"https://owacs-ender.itch.io/projectnoah","description":"A campaign planner for the Lancer TTRPG, designed to simplify the process of organizing notes for running the game. The software addressed a significant barrier to entry in community.","tech":["Notion","Python","Pytest","FastAPI","Svelte","Docker"],"sar":["Designed campaign planner template for Lancer TTRPG, resulting in over 100 licenses sold. Addressed significant barrier to entry in community.","Engineering FastAPI, Svelte, and GraphQL application to facilitate improved Agile development. Improving upon current unmalleable Notion solution."]},{"title":"Selenium Oxide","start":"Mar. 2022","end":"Present","featured":true,"alt":"Selenium Oxide","link":"https://github.com/ApprenticeofEnder/Selenium-Oxide","description":"Created a Selenium wrapper and framework designed to streamline browser-based web exploitation. Endorsed by ex-IBM penetration testers.","tech":["Python","Pytest","FastAPI","Selenium","Docker"],"sar":["Created Docker-based testing environment for live network requests, facilitating dependable functional/integration testing."]}]}