{"experience":[{"title":"Co-op, Cybersecurity","company":"BDO Canada","start":"May. 2024","end":"Present","location":"Ottawa, ON","src":"/images/bdo.png","alt":"BDO Canada","tech":["Microsoft Azure","Powershell","Microsoft Sentinel"],"sar":null},{"title":"Co-op Security Specialist","company":"Innovapost","start":"May. 2023","end":"Aug. 2023","location":"Ottawa, ON","src":"/images/innovapost.png","alt":"Innovapost","tech":["HTML","JavaScript","VBA"],"sar":["Independently devised automation suite using HTML, JavaScript, VBA, and 0 external libraries to decrease audit timeframes from weeks to minutes.","Evaluated security model of proprietary OS to determine feasibility and necessity of installing antivirus software. Motivated by security/audit risks."]},{"title":"Co-op Software Engineer","company":"Barracuda Networks","start":"Jan. 2023","end":"Apr. 2023","location":"Ottawa, ON","src":"/images/barracuda.png","alt":"Barracuda","tech":["C#","ASP.NET","Microsoft Azure","Docker","Linux","Windows","AWS"],"sar":["Diagnosed RMM incompatibility issues in monitoring clients using Azure VMs, Docker, and Linux. Root cause: decades old user agent still in use.","Examined and presented to regional leadership select AWS machine learning technologies for integration with new product. Received unanimous positive feedback.","Collaborated with colleagues to solve a C# API versioning discrepancy. Negotiated with QA and architecture teams to devise appropriate, considerate solution."]},{"title":"Co-op Penetration Tester","company":"SoftwareSecured","start":"May. 2022","end":"Aug. 2022","location":"Ottawa, ON","src":"/images/softwaresecured.png","alt":"SoftwareSecured","tech":["Python","Linux","OWASP ZAP","Burp Suite","AWS","FastAPI","Docker","Bash","Ruby on Rails"],"sar":["Detected hard-coded credentials in Ruby on Rails application. Reported potential secrets management issue and leakage risk to development team.","Identified critical denial-of-service condition in web application using regular expressions and Burp Suite. Averted hours-long environment shutdown.","Optimized network reconnaissance 5-10x using Bash script to find subdomains of primary domain and launch network scans on each.","Streamlined open source vulnerability analysis via Snyk using Python, concurrent programming, and web scraping. Automated 80% of effort.","Tested for server-side request forgery vulnerabilities by deploying AWS virtual machine to catch requests. Hosted custom FastAPI (Python) server for in-depth testing.","Educated clients on security findings using CVSS scoring and realistic attack scenarios to accurately portray business and technical risk."]},{"title":"Co-op Software Developer","company":"Reshift Security","start":"May. 2021","end":"Dec. 2021","location":"Ottawa, ON","src":"/images/reshiftsecurity.png","alt":"Reshift Security","tech":["Python","Django","Angular","PostgreSQL","JavaScript","TypeScript","HTML/CSS","Tailwind","Linux","Docker","Git"],"sar":["Collaboratively engineered secure password reset feature in Angular and Django. Used JWTs and one time passwords to ensure non-repudiation and authenticity.","Overhauled backup workflow for tool using Django and SendSafely REST API. Solved inability to recover from data loss within 24 hours of incident.","Repaired Java-based Intellij plugin suffering from broken breakpoint icons when scanning code. Utilized integrated debuggers and creative troubleshooting.","Installed secure authentication for client-facing application with SSO and JWT authentication in TypeScript and SvelteKit. Mitigated risk of credential compromise via database breach.","Independently maintained Docker-based application deployments using Docker, virtual machines, and Git. Oversaw full environment migration, learning critical lesson about checking which environment the production data was actually in.","Devised Python script to curate GitHub repositories for CENGN event using appropriate REST API. Enabled list-based elimination vs original lengthy active search.","Programmed custom PostgreSQL queries when Django's ORM failed. Optimized heatmap and other data visualization of security findings using server-side processing vs client-side."]}],"projects":[{"title":"CourseFull","start":"2024","end":"Present (WIP)","featured":true,"alt":"CourseFull","description":"A Ruby on Rails and NextJS web application that enables students to establish dynamic, data-driven academic goals. Described as a tool pre-med students would \"...[foam] at the mouth over...\"","tech":["Ruby on Rails","React","NextJS","PostgreSQL","Supabase"],"sar":null},{"title":"Selenium Oxide","start":"Mar. 2022","end":"Aug. 2022","featured":true,"alt":"Selenium Oxide","description":"Created a Selenium wrapper designed to streamline browser-based web exploitation. Endorsed by ex-IBM penetration testers.","tech":["Python","Selenium"],"sar":null}]}